[
  {
    "id": "bitovi-2021",
    "title": "Frontend Engineer",
    "company": "Bitovi",
    "date": "Oct 2021 - Present",
    "technologies": ["TypeScript", "React", "Next.js", "GraphQL"],
    "description": "Currently leading one of the WEB teams on the client side as a senior engineer. Worked on developing the Staffing App, an internal tool for managing company assets. Acted as a Senior Frontend Consultant for a major client, integrating into their front-end team, maintaining the website, developing new features, and focusing primarily on SDK development — a middleware used for data consumption for both WEB and APP.",
    "links": [
      {
        "label": "Bitovi",
        "url": "https://www.bitovi.com/"
      }
    ]
  },
  {
    "id": "mijem-2021",
    "title": "Frontend Developer",
    "company": "Mijem Inc.",
    "date": "Aug 2021 - Oct 2021",
    "technologies": ["TypeScript", "React", "HTML", "CSS"],
    "description": "A craiglist for students, Mijem is a platform for buying and selling used items. Worked on the kick-off of the front-end development of the new website. Contributed to delivering the MVP under a very strict schedule.",
    "links": [
      {
        "label": "Mijem",
        "url": "https://www.mijem.com/"
      }
    ]
  },
  {
    "id": "connectabil-2021",
    "title": "Frontend Developer",
    "company": "Connectabil",
    "date": "Apr 2021 - Sep 2021",
    "technologies": ["TypeScript", "React", "Styled Components", "REST"],
    "description": "A HR portal that connects companies with candidates (Mainly for accounting roles). Worked on the front-end development of the platform, focusing on creating a user-friendly interface and ensuring a smooth user experience. Collaborated with a team of developers and designers to deliver high-quality features in a fast-paced environment. Helped building from 0 to 1 the whole new platform.",
    "links": [
      {
        "label": "Connectabil",
        "url": "https://www.connectabil.com/"
      }
    ]
  },
  {
    "id": "nando-moura-2021",
    "title": "Web Developer (Freelancer)",
    "company": "Cursos Nando Moura",
    "date": "Apr 2021 - May 2021",
    "technologies": ["TypeScript", "Next.js"],
    "description": "Developed high-traffic websites for selling online courses, optimized to handle thousands of simultaneous users driven by online campaigns.",
    "links": [],
    "images": [
      {
        "src": "/cursos-nando-moura/maestros-do-musicalismo.png",
        "alt": "Mestres do Musicalismo",
        "description": "Maestros do Musicalismo is a high-traffic landing page designed to sell online music courses."
      },
      {
        "src": "/cursos-nando-moura/idiomas.png",
        "alt": "Idiomas",
        "description": "Idiomas is a high-traffic landing page for selling online language courses."
      }
    ]
  },
  {
    "id": "plen-robotics-2020",
    "title": "Software Developer",
    "company": "PLEN Robotics",
    "date": "Apr 2020 - Apr 2021",
    "technologies": ["JavaScript", "Vue.js", "Node.js", "Python", "IoT"],
    "description": "Worked on Plen Cube, an Alexa-like personal assistant robot with advanced features such as a camera and directional microphone. Developed the frontend web applications for the robot, which were self-hosted on the device itself, enabling users to interact through a web interface. Helped on the Plen Dashboard, a web app for managing the robot's functions and settings. Helped on Booster, a system to automatically schedule medical appointments via the PLEN Cube. Developed another system for the professor to monitor students' attendance and temperature (for COVID-19 purposes) in classrooms. Also worked on a system to sell food at kiosks.",
    "links": [
      {
        "label": "PLEN Robotics",
        "url": "https://plenrobotics.com/"
      }
    ],
    "images": [
      {
        "src": "/plen-robotics/plen-robot.png",
        "alt": "Plen Robot with a termal sensor",
        "description": "Plen Robot with a termal sensor addon. Used for measuring body temperature in multiple applications."
      },
      {
        "src": "/plen-robotics/plen-robot-iot.gif",
        "alt": "Plen Robot face recognizion",
        "description": "Plen Robot using face recognizion and opening a lock with IoT."
      },
      {
        "src": "/plen-robotics/booster.png",
        "alt": "Booster data flow",
        "description": "Booster, a system to automatically book medic consults via the PLEN Cube."
      }
    ]
  },
  {
    "id": "amplimed-2018",
    "title": "Fullstack Engineer",
    "company": "Amplimed",
    "date": "Dec 2018 - Mar 2020",
    "technologies": [
      "JavaScript",
      "PHP",
      "JQuery",
      "PostgreSQL",
      "MongoDB",
      "REST"
    ],
    "description": "Amplimed is a healthcare company that provides a platform for managing medical records and appointments. Developed the front-end and back-end of the platform, focusing on creating a user-friendly interface and ensuring data integrity. Worked on integrating various APIs and databases to enhance the functionality of the platform.",
    "links": [
      {
        "label": "Amplimed",
        "url": "https://amplimed.com.br/"
      }
    ],
    "images": [
      {
        "src": "/amplimed/scheduler.png",
        "alt": "Amplimed scheduler view",
        "description": "Amplimed scheduler view from the clinic perspective."
      }
    ]
  },
  {
    "id": "xande-informatica-2013",
    "title": "Technical Support",
    "company": "Xande Informática",
    "date": "Feb 2013 - Nov 2013",
    "technologies": ["Hardware", "Windows OS", "Customer Service"],
    "description": "Provided technical support for computer hardware and software. Responsibilities included assembly, installation, troubleshooting, and direct customer service.",
    "links": []
  }
]
